# ProjectAddress Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ProjectAddress Property
ParameterTypeId Class See Also
---
"Project Address"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ProjectAddress { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProjectAddress As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ProjectAddress {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace